# PipeFittingAndAccessoryPressureDropData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropData Class
Members See Also
---
The input and output data used by external servers for calculation of the pipe fitting and pipe accessory pressure drop.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PipeFittingAndAccessoryPressureDropData : IDisposable
```

Visual Basic
---
```text
Public Class PipeFittingAndAccessoryPressureDropData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PipeFittingAndAccessoryPressureDropData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..PipeFittingAndAccessoryPressureDropData
# See Also
PipeFittingAndAccessoryPressureDropData Members
Autodesk.Revit.DB.Plumbing Namespace